/*
Реализуйте цифровой спидометр автомобиля. Сама модель автомобиля, которую нужно будет воссоздать, весьма проста. Начальная скорость — 0 км/ч.
Пользователь вводит в стандартный ввод разницу (дельту) в скорости, и результирующая скорость показывается на спидометре в стандартный вывод.
Так происходит до той поры, пока машина снова не остановится, то есть пока скорость не станет меньше или равна нулю (сравнение должно происходить с дельтой в 0,01).
Диапазон возможных значений скорости машины от 0 до 150 км/ч.
Сам показатель спидометра вместе с единицами измерения требуется записывать в отдельную строку-буфер, которая потом и будет показываться на экране.
Точность отображения скорости — до 0,1 км/ч.
*/

#include <iostream>
#include <cmath>

int main () {
    float speedValue = 0.;
    do {
        char speedStr[6];
        std::sprintf(speedStr, "%.1f", speedValue);
        std::cout << "Current speed: " << speedStr << "\n";

        std::string deltaSpeedStr;
        std::cout << "Delta speed: ";
        std::cin >> deltaSpeedStr;
        
        float deltaSpeed = std::stof(deltaSpeedStr);
        speedValue + deltaSpeed > 150. ? speedValue = 150. : speedValue += deltaSpeed;
    } while (speedValue > 0.01);

    return 0;
}